{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features related to displaying Claude API analysis results with rating circles, explanations, Bible verses, and a \"Try Another\" button, all mapped to HomePage.tsx with high confidence.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing the app structure: React app with TanStack Router, Claude API integration for Biblical content analysis, inline results display with color-coded ratings, and API key management.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system defining light and dark theme variables for a faith-inspired design palette.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the Biblical Lens application.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with single home route, wrapped in QueryClient, InternetIdentityProvider, and AnalysisProvider contexts.",
  "frontend/src/components/ApiKeyInput.tsx": "Component for entering, saving, editing, and clearing Anthropic API keys with localStorage persistence, validation, show/hide toggle, and links to obtain keys.",
  "frontend/src/components/BibleVerse.tsx": "Component displaying Bible verse text in blockquote format with reference and NIV attribution, styled with quote icon.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header showing Biblical Lens branding, main content outlet, and footer with caffeine.ai attribution.",
  "frontend/src/components/RatingCircle.tsx": "Component rendering large colored circle with icon (green/yellow/red) indicating Biblical alignment rating with corresponding label and glow effect.",
  "frontend/src/contexts/AnalysisContext.tsx": "React context provider managing analysis results and video description state, enabling data sharing across components with setAnalysis and clearAnalysis methods.",
  "frontend/src/hooks/useActor.ts": "Custom hook creating and managing backend actor instances with Internet Identity authentication, invalidating dependent queries when actor changes.",
  "frontend/src/hooks/useApiKey.ts": "Custom hook managing Anthropic API key state with localStorage persistence, providing get, set, and clear operations.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication on ICP, managing login state, identity storage, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating the app uses direct API calls instead of backend queries.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm, faith-inspired color palette including primary colors, rating colors (green/yellow/red), and dark mode variants using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/HomePage.tsx": "Main page component that handles video description input, triggers Claude API analysis, and displays results (rating circle, explanation, Bible verse) with a 'Try Another' reset button.",
  "frontend/src/pages/ResultsPage.tsx": "Empty file, indicating results are displayed inline on HomePage rather than on a separate page.",
  "frontend/src/services/claudeApi.ts": "Service layer that calls the Anthropic Claude API to analyze video descriptions and return structured JSON with rating, explanation, verse reference, and verse text.",
  "frontend/src/types/analysis.ts": "TypeScript interface defining the AnalysisResult structure with rating, explanation, verseReference, and verseText fields.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with custom colors using OKLCH values, container settings, animations, and plugins for typography and container queries.",
  "project_state.json": "Project metadata tracking the Biblical Lens app's architecture, features, and requirements including inline results display, AI-provided Bible verses, and the 'Try Another' reset functionality."
}